
export const newsItems = [
    {
        id: 1,
        date: "2025年7月26日",
        title: "福岡工業大学 \nオープンキャンパス 参加",
        content: "福岡工業大学のオープンキャンパスにスタッフとして参加しました。\nB棟5階の個別相談ブースにて、短大への入学、大学への編入相談を担当しました。\n多くの方に「とても参考になった」、「ぜひここの短大を受験したい」との声をいただき、非常に嬉しかったです。",
        link: "#" // Optional link to a blog post or more details
    },
    {
        id: 2,
        date: "2025年7月25日",
        title: "ウイングアーク1st株式会社さんのLT会に参加",
        content: "「生成AIについて語ろう」ということで、テーマは生成AIについてでした。\n生成AIを使ってのHPの制作、モデルごとの比較、AIを使うときの心構えなど、どのLTも内容が濃く、有意義な時間を過ごせました。\n(特に同じプロンプトを投げてモデルごとに比較するやつが面白かったです)",
        link: "https://wingarc1st-techevent.connpass.com/event/358566/"
    },
    {
        id: 3,
        date: "2025年7月12日",
        title: "チャレキャラ\nアイデア発表会 参加",
        content: "天神で開催されたチャレキャラのアイデア発表会に参加してきました。\n私たちは「V-chat」という互いにVRアバターの姿で会話ができるコミュニケーションアプリを発表しました。\n発表後、企業の方からフィードバックを頂き、今後の開発において非常に参考になりました。",
        link: "https://www.canva.com/design/DAGsfj57PDY/6TeQMZyRVilRWeCg9VSutg/edit"
    },
    {
        id: 4,
        date: "2025年7月8日",
        title: "初音ミク「マジカルミライ 2025」プログラミング・コンテスト 作品応募",
        content: "締め切りギリギリまで開発してました。\n4月から3か月間の開発でしたが、チームで一丸となってなんとか作品を作り上げることが出来ました。\nコンテストの入選発表は8月9日に発表なので是非お楽しみに～",
        link: "https://magicalmirai.com/2025/procon/"
    },
    {
        id: 5,
        date: "2025年7月5日",
        title: "技育博 vol3 参加",
        content: "サポーターズさん主催の技育博に、サークルのメンバーと2人で参加してきました。\n東京の虎ノ門ヒルズの36階が会場でしたが、めちゃめちゃ景色が良かったです（笑）。\n全国各地から学生が参加していましたが、どのプロダクトも非常に完成度が高くて驚きました。 \nまた私たちは、部内ハッカソンで制作した「寝過ごしパニック」というプロダクトを出しました。\n企業の方からたくさんのフィードバックを頂き、今後の開発のモチベーションになりました。",
        link: "#"
    },
];
